[
  {
  "category": "business",
  "title": "200 Arrested in France as Protesters Clash With Police Amid New PM Appointment",
  "shortdescription": "Widespread protests in France disrupt daily life as citizens react to political changes, prompting mass arrests and police intervention.",
  "description": "Tensions erupted across France as protesters clashed with police following the appointment of a new prime minister by President Emmanuel Macron. Demonstrators blocked roads, set fires, and faced tear gas from law enforcement in Paris and other cities. Authorities reported approximately 200 arrests, highlighting the scale of civil unrest. Analysts note that such protests can have significant economic implications, including disruptions to businesses, transportation, and investor confidence, emphasizing the intersection of political events and economic stability.",
  "image": "/images/france-protests-arrests.webp",
  "slug": "france-protests-arrests-new-pm",
  "date": "10th September 2025"
}
,
{
  "category": "business",
  "title": "Novo Nordisk to Cut 9,000 Jobs to Focus on Obesity and Diabetes Treatments",
  "shortdescription": "Pharmaceutical giant Novo Nordisk announces a major workforce reduction to sharpen focus on growth in obesity and diabetes medications.",
  "description": "Danish pharmaceutical company Novo Nordisk, known for its weight-loss drug Wegovy, has announced plans to cut 9,000 jobs globally, including 5,000 positions in Denmark. The move aims to streamline operations and strengthen the company's focus on growth opportunities in obesity and diabetes treatments, where competition is intensifying. Analysts note that the restructuring could improve efficiency and innovation, enabling Novo Nordisk to better respond to market demands while maintaining its position as a leader in metabolic therapies.",
  "image": "/images/novo-nordisk-job-cuts.webp",
  "slug": "novo-nordisk-job-cuts-obesity-diabetes",
  "date": "10th September 2025"
}
,
{
  "category": "business",
  "title": "Global Shares Rise Following Wall Street Rally on Job Market Optimism",
  "shortdescription": "Global stock markets gain momentum as Wall Street records a rally, fueled by positive U.S. job market data and expectations of interest rate cuts.",
  "description": "Global equity markets mostly rose as investors responded positively to a strong rally on Wall Street. The surge came after new U.S. job market data raised hopes that the Federal Reserve may ease interest rates, supporting economic growth and boosting investor confidence. Analysts suggest that this optimism is driving gains across multiple sectors worldwide, reflecting renewed enthusiasm for equities and a more favorable environment for global investment. However, some caution remains amid ongoing geopolitical and economic uncertainties.",
  "image": "/images/global-shares-wall-street-rally.webp",
  "slug": "global-shares-rise-wall-street-rally",
  "date": "9th September 2025"
}
,
{
  "category": "business",
  "title": "South Korea Sends Plane to U.S. to Repatriate Workers Detained in Immigration Raid",
  "shortdescription": "A charter plane has been dispatched to bring back South Korean workers detained during an immigration raid in Georgia, highlighting labor and immigration challenges.",
  "description": "South Korean authorities have sent a charter plane to the United States to repatriate workers who were detained in an immigration raid in Georgia. The operation follows reports that dozens of South Korean nationals faced detention, raising concerns about labor rights, immigration enforcement, and diplomatic coordination. Officials emphasize the importance of protecting citizens abroad while ensuring compliance with U.S. immigration regulations. Analysts note that incidents like these can impact international labor mobility and highlight the need for clear policies and communication between countries.",
  "image": "/images/south-korea-us-workers-raid.webp",
  "slug": "south-korea-us-workers-immigration-raid",
  "date": "9th September 2025"
}
,
{
  "category": "business",
  "title": "Court Allows Fed Governor Lisa Cook to Stay While Fighting Trump’s Attempt to Remove Her",
  "shortdescription": "A federal court rules that Federal Reserve Governor Lisa Cook can remain in her role while challenging efforts by former President Trump to dismiss her.",
  "description": "A federal court has temporarily blocked the removal of Federal Reserve Governor Lisa Cook, allowing her to continue serving while she contests former President Donald Trump’s attempt to fire her. The ruling underscores the legal protections for independent Federal Reserve officials and highlights the ongoing tensions between political authorities and central bank governance. Analysts suggest that maintaining stability within the Fed is crucial for financial markets, as leadership disputes can influence monetary policy decisions, investor confidence, and broader economic stability.",
  "image": "/images/lisa-cook-fed-governor.webp",
  "slug": "lisa-cook-fed-court-ruling",
  "date": "9th September 2025"
}
,
{
  "category": "business",
  "title": "Trump’s Policies Strain U.S. Alliances Key to Countering China",
  "shortdescription": "President Trump’s trade and immigration decisions are putting pressure on critical alliances with countries like South Korea and India.",
  "description": "President Donald Trump’s approach to trade and immigration is creating tensions with vital U.S. allies, including South Korea and India, which play strategic roles in countering China’s global influence. Analysts warn that strained diplomatic relationships could complicate economic cooperation, security partnerships, and regional stability in Asia. Experts emphasize the importance of balancing domestic policy goals with international alliances to maintain influence and coordinate effectively on global economic and geopolitical challenges.",
  "image": "/images/trump-us-allies-china.webp",
  "slug": "trump-policies-strain-us-allies-china",
  "date": "9th September 2025"
}
,
{
  "category": "business",
  "title": "Klarna Prices IPO at $40, Valuing BNPL Company at $15 Billion",
  "shortdescription": "Swedish fintech Klarna sets its IPO price at $40 per share, giving the buy now, pay later company a market valuation of $15 billion ahead of its trading debut.",
  "description": "Klarna, the Swedish buy now, pay later (BNPL) fintech, has priced its highly anticipated initial public offering at $40 per share, valuing the company at approximately $15 billion. The IPO reflects growing investor interest in alternative payment solutions and fintech innovation, even as the sector faces regulatory scrutiny and increasing competition. Analysts note that Klarna’s market debut will be closely watched as a benchmark for the broader BNPL industry, providing insights into investor appetite for consumer finance platforms and the future trajectory of digital payment services.",
  "image": "/images/klarna-ipo-40.webp",
  "slug": "klarna-ipo-40bnpl-15billion",
  "date": "9th September 2025"
}
,
{
  "category": "business",
  "title": "Trump’s Tariffs Impact U.S. Company Sales in China, Survey Finds",
  "shortdescription": "A recent survey shows that U.S. companies operating in China expect declining sales due to tariffs and retaliatory measures.",
  "description": "Many U.S. companies with operations in China anticipate a decline in sales this year as a result of tariffs imposed by former President Donald Trump and China’s retaliatory trade measures. The survey highlights the economic ripple effects of trade tensions on multinational businesses, supply chains, and market strategies. Analysts warn that continued tariff-related uncertainty could hinder growth, disrupt planning, and affect profitability for firms reliant on the Chinese market, underscoring the complex interplay between policy decisions and international business operations.",
  "image": "/images/trump-tariffs-us-china.webp",
  "slug": "trump-tariffs-impact-us-china-sales",
  "date": "9th September 2025"
}
,
{
  "category": "business",
  "title": "NTSB Details Severe Turbulence That Injured Passengers on Delta Flight",
  "shortdescription": "The NTSB report describes how passengers were thrown around the cabin during a Delta flight encountering violent turbulence en route to Europe.",
  "description": "A recent National Transportation Safety Board (NTSB) report reveals that passengers on a Delta Air Lines flight to Europe were violently tossed around the cabin during severe turbulence in July. Those who were not wearing seatbelts were thrown against the ceiling and then back to the floor, resulting in injuries. The incident underscores the importance of following airline safety protocols, particularly fastening seatbelts whenever seated. Aviation experts note that turbulence can occur unexpectedly and that such reports highlight the ongoing need for passenger awareness and crew preparedness to minimize injury risks.",
  "image": "/images/delta-flight-turbulence.webp",
  "slug": "ntsbturbulence-delta-flight-report",
  "date": "9th September 2025"
}
,
{
  "category": "business",
  "title": "UN Chief Urges Investment in Poverty Reduction Over Military Spending",
  "shortdescription": "The UN warns that excessive global military expenditures are limiting investments in health, education, and job creation, impacting long-term security.",
  "description": "United Nations leadership has called for a shift in global priorities, emphasizing that investing in poverty reduction, education, healthcare, and employment opportunities can foster a more secure world than escalating military spending. The UN chief highlighted that soaring defense budgets do not guarantee peace and often divert resources from programs that directly improve societal well-being. Experts note that rebalancing investments toward social development could mitigate conflict drivers, enhance economic resilience, and create sustainable pathways to global stability.",
  "image": "/images/un-poverty-investment.webp",
  "slug": "un-chief-invest-poverty-security",
  "date": "9th September 2025"
}
,
{
  "category": "business",
  "title": "Chief Justice Roberts Maintains Trump-Era Foreign Aid Freeze",
  "shortdescription": "The Supreme Court temporarily upholds the freeze on nearly $5 billion in foreign aid, affecting international development programs.",
  "description": "Chief Justice John Roberts has temporarily allowed the Trump administration’s freeze on nearly $5 billion in foreign aid to remain in effect. The ruling affects a range of international development programs and could delay funding for critical projects around the world. Legal experts emphasize that the decision highlights the complex intersection of domestic policy, judicial oversight, and global economic implications. The temporary freeze raises questions about the impact on U.S. diplomatic relations and the operational stability of foreign aid initiatives dependent on timely funding.",
  "image": "/images/foreign-aid-freeze.webp",
  "slug": "roberts-trump-foreign-aid-freeze",
  "date": "9th September 2025"
}
,
{
  "category": "business",
  "title": "Alex Jones Appeals $1.4 Billion Sandy Hook Judgment to U.S. Supreme Court",
  "shortdescription": "Far-right commentator Alex Jones requests the Supreme Court to review the $1.4 billion judgment against him over false claims about the Sandy Hook shooting.",
  "description": "Conspiracy theorist Alex Jones has filed a petition asking the U.S. Supreme Court to hear his appeal of a $1.4 billion judgment imposed by a Connecticut court. The original ruling held Jones liable for defamation and emotional distress after he falsely claimed that the 2012 Sandy Hook Elementary School shooting was a hoax. Legal experts note that the case raises significant questions about freedom of speech, accountability for misinformation, and the financial consequences of spreading harmful falsehoods. The Supreme Court’s decision to accept or decline the appeal will have wide-ranging implications for media and public discourse.",
  "image": "/images/alex-jones-sandy-hook-appeal.webp",
  "slug": "alex-jones-supreme-court-appeal-sandy-hook",
  "date": "9th September 2025"
}
,
{
  "category": "business",
  "title": "Over 60 Containers Fall Off Cargo Ship at Long Beach Port",
  "shortdescription": "A cargo mishap at the Port of Long Beach caused more than 60 containers to fall into the water, disrupting shipping operations.",
  "description": "More than 60 shipping containers toppled from a cargo vessel at the Port of Long Beach, landing in the water and posing potential hazards to navigation and the environment. Authorities are working to recover the containers and assess any damages, while port operations may face temporary disruptions. Shipping analysts note that such incidents highlight the importance of stringent safety protocols, secure cargo handling, and monitoring to prevent similar accidents. The event underscores the challenges faced by major ports in managing high volumes of international trade.",
  "image": "/images/long-beach-port-containers.webp",
  "slug": "long-beach-port-containers-fall",
  "date": "9th September 2025"
}
,
{
  "category": "business",
  "title": "South Korea Moves to Repatriate Workers Detained in U.S. Raid Amid Ongoing Concerns",
  "shortdescription": "South Korea’s foreign minister visits the U.S. to manage the return of over 300 workers detained in a recent immigration raid, while local residents remain anxious.",
  "description": "The South Korean government is taking steps to repatriate more than 300 workers detained during a U.S. immigration raid, with the country’s foreign minister traveling to the United States to coordinate their return. While plans are underway to ensure safe repatriation, concerns linger among local communities regarding the impact of immigration enforcement on residents and labor conditions. Experts highlight that such incidents underscore the importance of diplomatic engagement, labor protections, and clear policies to manage international workforce issues effectively.",
  "image": "/images/korean-workers-us-raid.webp",
  "slug": "south-korea-us-workers-repatriation",
  "date": "9th September 2025"
}
,
{
  "category": "business",
  "title": "Supreme Court to Expedite Review of Trump’s Authority to Impose Broad Tariffs",
  "shortdescription": "The U.S. Supreme Court will quickly hear a case assessing whether former President Trump had legal authority to implement sweeping tariffs.",
  "description": "The Supreme Court has announced an expedited hearing to determine whether former President Donald Trump had the legal authority under federal law to impose wide-ranging tariffs. The case raises critical questions about executive power, trade policy, and the balance of authority between the presidency and Congress. Legal analysts note that the court’s decision could have far-reaching implications for U.S. trade policy, international relations, and the precedent for future tariff actions by the executive branch.",
  "image": "/images/supreme-court-trump-tariffs.webp",
  "slug": "supreme-court-trump-tariffs-authority",
  "date": "9th September 2025"
}
,
{
  "category": "business",
  "title": "Apple Unveils iPhone 17 Lineup, Introducing the First iPhone Air",
  "shortdescription": "Apple launches its iPhone 17 series, featuring the brand-new iPhone Air, with updates across design, performance, and camera capabilities.",
  "description": "Apple has officially unveiled its iPhone 17 lineup, including the first-ever iPhone Air. The new series brings several innovations, including enhanced processing power, improved camera systems, and refined designs aimed at both performance and user experience. The iPhone Air offers a lighter, more compact option for users seeking portability without sacrificing key features. Industry analysts suggest that the iPhone 17 launch reinforces Apple’s position in the competitive smartphone market and highlights ongoing trends in technology innovation and consumer demand.",
  "image": "/images/apple-iphone-17-air.webp",
  "slug": "apple-iphone-17-lineup-air",
  "date": "9th September 2025"
}
,
{
  "category": "business",
  "title": "Man Pleads Guilty to Attempted Drone Attack on Nashville Power Substation",
  "shortdescription": "A 24-year-old man linked to white nationalist groups admits to trying to bomb a Nashville electricity site using a drone.",
  "description": "A Nashville man has pleaded guilty to charges related to an attempted attack on a local electricity substation using a bomb-laden drone. Prosecutors reported that the 24-year-old suspect, associated with white nationalist movements, intended to disrupt power infrastructure, posing serious risks to public safety and regional energy security. Experts emphasize the growing threat of drones in criminal and extremist activities, highlighting the need for advanced security measures, regulatory oversight, and vigilance in protecting critical infrastructure.",
  "image": "/images/nashville-drone-attack.webp",
  "slug": "nashville-drone-power-substation-guilty",
  "date": "9th September 2025"
}
,
{
  "category": "business",
  "title": "Georgia Governor’s Electric Mobility Vision Faces Test After South Korean Workers Detained",
  "shortdescription": "Governor Brian Kemp’s push for foreign investment in Georgia’s electric mobility sector coincides with controversy over detained South Korean workers.",
  "description": "Georgia Governor Brian Kemp has been promoting his vision for electric mobility and welcoming foreign investment into the state’s transportation and clean energy sectors. However, his plans face scrutiny following the detention of South Korean workers in an immigration raid, raising concerns about labor relations and investor confidence. The situation highlights the delicate balance between fostering economic growth, ensuring fair labor practices, and maintaining Georgia’s reputation as a hub for innovative industries.",
  "image": "/images/georgia-electric-mobility.webp",
  "slug": "georgia-electric-mobility-south-korea-raid",
  "date": "9th September 2025"
}
,
{
  "category": "business",
  "title": "Aroldis Chapman Signs $13.3 Million, 1-Year Deal With Boston Red Sox for 2026",
  "shortdescription": "Pitcher Aroldis Chapman agrees to a one-year contract with the Red Sox worth $13.3 million, securing his spot for the 2026 season.",
  "description": "The Boston Red Sox have finalized a one-year contract with star pitcher Aroldis Chapman, valued at $13.3 million for the 2026 season. Chapman, known for his powerful fastball and closing abilities, brings experience and stability to the Red Sox bullpen. The deal reflects both his on-field value and the competitive dynamics of Major League Baseball salaries. Analysts note that such contracts are crucial for teams managing roster talent, payroll strategy, and long-term championship aspirations.",
  "image": "/images/aroldis-chapman-red-sox-contract.webp",
  "slug": "aroldis-chapman-red-sox-2026-contract",
  "date": "9th September 2025"
}
,
{
  "category": "business",
  "title": "U.S. Steel Halts Production at Illinois Plant Without Layoffs",
  "shortdescription": "U.S. Steel will stop processing steel slabs at Granite City Works in Illinois, but workers will not face layoffs following the production shift.",
  "description": "U.S. Steel announced that it will cease steel slab production at its Granite City Works plant in Illinois. The company emphasized that this operational change will not result in layoffs, ensuring job security for its employees. The decision comes three months after Nippon Steel finalized a deal with former President Donald Trump to acquire the iconic American steelmaker. Industry analysts note that while production adjustments are part of modern manufacturing strategies, maintaining the workforce demonstrates a commitment to employee stability amid operational restructuring.",
  "image": "/images/us-steel-illinois-plant.webp",
  "slug": "us-steel-illinois-plant-production-halt",
  "date": "9th September 2025"
}
,
{
  "category": "business",
  "title": "NY Prosecutor Warns of More Raids After 57 Detained at Snack Bar Plant",
  "shortdescription": "Federal authorities detained 57 workers during a raid on an upstate New York snack bar facility, signaling potential further enforcement actions.",
  "description": "Federal prosecutors in New York detained 57 individuals following a raid on a snack bar manufacturing plant in upstate New York. Authorities have warned that additional raids could occur as part of ongoing enforcement efforts targeting labor violations and compliance issues. The incident has raised concerns about workforce management, regulatory adherence, and the broader implications for food manufacturing operations. Experts highlight that companies must maintain strict oversight of labor practices to avoid legal consequences and ensure safe, lawful operations.",
  "image": "/images/ny-snack-bar-raid.webp",
  "slug": "ny-snack-bar-plant-raid-57-detained",
  "date": "9th September 2025"
}
,
{
  "category": "business",
  "title": "Katseye’s ‘Gap’ Ad Hits 400 Million Views in 3 Days – The Viral Success Story",
  "shortdescription": "Global girl group Katseye sees massive exposure as their advertisement ‘Gap’ reaches 400 million views in just three days.",
  "description": "Global girl group Katseye has skyrocketed to international fame after their advertisement for ‘Gap’ went viral, amassing 400 million views within three days. The rapid surge in attention demonstrates the power of strategic marketing, social media engagement, and fan-driven promotion. Industry analysts note that such viral campaigns can significantly boost brand recognition, streaming numbers, and concert demand. Katseye’s success story highlights how modern entertainment marketing leverages digital platforms to create immediate, global impact.",
  "image": "/images/katseye-gap-viral.webp",
  "slug": "katseye-gap-ad-viral-success",
  "date": "9th September 2025"
}
,
{
  "category": "business",
  "title": "CBS News Appoints Ombudsman With Expanded Role and Unique Background",
  "shortdescription": "CBS News names Kenneth Weinstein as its new ombudsman, with duties and a background that differ from traditional journalism definitions of the role.",
  "description": "CBS News has appointed Kenneth Weinstein as its new ombudsman, tasked with reviewing consumer complaints and ensuring accountability. Unlike traditional ombudsmen in journalism, Weinstein brings a unique background and a broader set of responsibilities that go beyond standard editorial oversight. Media analysts suggest that this move reflects a growing trend of redefining oversight roles in news organizations to address evolving audience expectations, enhance transparency, and maintain trust in an era of rapid information dissemination.",
  "image": "/images/cbs-news-ombudsman.webp",
  "slug": "cbs-news-ombudsman-kenneth-weinstein",
  "date": "9th September 2025"
}

]